LaloAlvarez-e/MSP430F169/Utilities/Rename_Files/DAC12/Peripheral/RegisterDefines/Header/DAC12_RegisterDefines_CTL0.h
/**
 *
 * @file DAC12_RegisterDefines_CTL0.h
 * @copyright
 * @verbatim InDeviceMex 2021 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 6 feb. 2022 @endverbatim
 *
 * @author
 * @verbatim InDeviceMex @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 6 feb. 2022     InDeviceMex    1.0         initial Version@endverbatim
 */

#ifndef DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_CTL0_H_
#define DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_CTL0_H_

#include "DriverLib/MCU/Header/MCU_Common.h"

/******************************************************************************************
 ************************************ 1 CTL0 *********************************************
 ******************************************************************************************/
/*-----------*/
#define DAC12_CTL0_R_SC_BIT ((uint16_t) 0U)

#define DAC12_CTL0_SC_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_SC_NA ((uint16_t) 0x00U)
#define DAC12_CTL0_SC_START ((uint16_t) 0x01U)

#define DAC12_CTL0_R_SC_MASK (DAC12_CTL0_SC_MASK << DAC12_CTL0_R_SC_BIT)
#define DAC12_CTL0_R_SC_NA (DAC12_CTL0_SC_NA << DAC12_CTL0_R_SC_BIT)
#define DAC12_CTL0_R_SC_START (DAC12_CTL0_SC_START << DAC12_CTL0_R_SC_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_ENC_BIT ((uint16_t) 1U)

#define DAC12_CTL0_ENC_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_ENC_DIS ((uint16_t) 0x00U)
#define DAC12_CTL0_ENC_ENA ((uint16_t) 0x01U)

#define DAC12_CTL0_R_ENC_MASK (DAC12_CTL0_ENC_MASK << DAC12_CTL0_R_ENC_BIT)
#define DAC12_CTL0_R_ENC_DIS (DAC12_CTL0_ENC_DIS << DAC12_CTL0_R_ENC_BIT)
#define DAC12_CTL0_R_ENC_ENA (DAC12_CTL0_ENC_ENA << DAC12_CTL0_R_ENC_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_TOVIE_BIT ((uint16_t) 2U)

#define DAC12_CTL0_TOVIE_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_TOVIE_DIS ((uint16_t) 0x00U)
#define DAC12_CTL0_TOVIE_ENA ((uint16_t) 0x01U)

#define DAC12_CTL0_R_TOVIE_MASK (DAC12_CTL0_TOVIE_MASK << DAC12_CTL0_R_TOVIE_BIT)
#define DAC12_CTL0_R_TOVIE_DIS (DAC12_CTL0_TOVIE_DIS << DAC12_CTL0_R_TOVIE_BIT)
#define DAC12_CTL0_R_TOVIE_ENA (DAC12_CTL0_TOVIE_ENA << DAC12_CTL0_R_TOVIE_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_OVIE_BIT ((uint16_t) 3U)

#define DAC12_CTL0_OVIE_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_OVIE_DIS ((uint16_t) 0x00U)
#define DAC12_CTL0_OVIE_ENA ((uint16_t) 0x01U)

#define DAC12_CTL0_R_OVIE_MASK (DAC12_CTL0_OVIE_MASK << DAC12_CTL0_R_OVIE_BIT)
#define DAC12_CTL0_R_OVIE_DIS (DAC12_CTL0_OVIE_DIS << DAC12_CTL0_R_OVIE_BIT)
#define DAC12_CTL0_R_OVIE_ENA (DAC12_CTL0_OVIE_ENA << DAC12_CTL0_R_OVIE_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_ON_BIT ((uint16_t) 4U)

#define DAC12_CTL0_ON_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_ON_OFF ((uint16_t) 0x00U)
#define DAC12_CTL0_ON_ON ((uint16_t) 0x01U)

#define DAC12_CTL0_R_ON_MASK (DAC12_CTL0_ON_MASK << DAC12_CTL0_R_ON_BIT)
#define DAC12_CTL0_R_ON_OFF (DAC12_CTL0_ON_OFF << DAC12_CTL0_R_ON_BIT)
#define DAC12_CTL0_R_ON_ON (DAC12_CTL0_ON_ON << DAC12_CTL0_R_ON_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_REFON_BIT ((uint16_t) 5U)

#define DAC12_CTL0_REFON_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_REFON_OFF ((uint16_t) 0x00U)
#define DAC12_CTL0_REFON_ON ((uint16_t) 0x01U)

#define DAC12_CTL0_R_REFON_MASK (DAC12_CTL0_REFON_MASK << DAC12_CTL0_R_REFON_BIT)
#define DAC12_CTL0_R_REFON_OFF (DAC12_CTL0_REFON_OFF << DAC12_CTL0_R_REFON_BIT)
#define DAC12_CTL0_R_REFON_ON (DAC12_CTL0_REFON_ON << DAC12_CTL0_R_REFON_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_REF2_5V_BIT ((uint16_t) 6U)

#define DAC12_CTL0_REF2_5V_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_REF2_5V_1_5V ((uint16_t) 0x00U)
#define DAC12_CTL0_REF2_5V_2_5V ((uint16_t) 0x01U)

#define DAC12_CTL0_R_REF2_5V_MASK (DAC12_CTL0_REF2_5V_MASK << DAC12_CTL0_R_REF2_5V_BIT)
#define DAC12_CTL0_R_REF2_5V_1_5V (DAC12_CTL0_REF2_5V_1_5V << DAC12_CTL0_R_REF2_5V_BIT)
#define DAC12_CTL0_R_REF2_5V_2_5V (DAC12_CTL0_REF2_5V_2_5V << DAC12_CTL0_R_REF2_5V_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_MSC_BIT ((uint16_t) 7U)

#define DAC12_CTL0_MSC_MASK ((uint16_t) 0x01U)
#define DAC12_CTL0_MSC_SINGLE ((uint16_t) 0x00U)
#define DAC12_CTL0_MSC_MULTIPLE ((uint16_t) 0x01U)

#define DAC12_CTL0_R_MSC_MASK (DAC12_CTL0_MSC_MASK << DAC12_CTL0_R_MSC_BIT)
#define DAC12_CTL0_R_MSC_SINGLE (DAC12_CTL0_MSC_SINGLE << DAC12_CTL0_R_MSC_BIT)
#define DAC12_CTL0_R_MSC_MULTIPLE (DAC12_CTL0_MSC_MULTIPLE << DAC12_CTL0_R_MSC_BIT)
/*-----------*/


#define DAC12_CTL0_SHT_MASK ((uint16_t) 0x0FU)
#define DAC12_CTL0_SHT_4 ((uint16_t) 0x00U)
#define DAC12_CTL0_SHT_8 ((uint16_t) 0x01U)
#define DAC12_CTL0_SHT_16 ((uint16_t) 0x02U)
#define DAC12_CTL0_SHT_32 ((uint16_t) 0x03U)
#define DAC12_CTL0_SHT_64 ((uint16_t) 0x04U)
#define DAC12_CTL0_SHT_96 ((uint16_t) 0x05U)
#define DAC12_CTL0_SHT_128 ((uint16_t) 0x06U)
#define DAC12_CTL0_SHT_192 ((uint16_t) 0x07U)
#define DAC12_CTL0_SHT_256 ((uint16_t) 0x08U)
#define DAC12_CTL0_SHT_384 ((uint16_t) 0x09U)
#define DAC12_CTL0_SHT_512 ((uint16_t) 0x0AU)
#define DAC12_CTL0_SHT_768 ((uint16_t) 0x0BU)
#define DAC12_CTL0_SHT_1024 ((uint16_t) 0x0CU)

/*-----------*/
#define DAC12_CTL0_R_SHT0_BIT ((uint16_t) 8U)

#define DAC12_CTL0_SHT0_MASK (DAC12_CTL0_SHT_MASK)
#define DAC12_CTL0_SHT0_4 (DAC12_CTL0_SHT_4)
#define DAC12_CTL0_SHT0_8 (DAC12_CTL0_SHT_8)
#define DAC12_CTL0_SHT0_16 (DAC12_CTL0_SHT_16)
#define DAC12_CTL0_SHT0_32 (DAC12_CTL0_SHT_32)
#define DAC12_CTL0_SHT0_64 (DAC12_CTL0_SHT_64)
#define DAC12_CTL0_SHT0_96 (DAC12_CTL0_SHT_96)
#define DAC12_CTL0_SHT0_128 (DAC12_CTL0_SHT_128)
#define DAC12_CTL0_SHT0_192 (DAC12_CTL0_SHT_192)
#define DAC12_CTL0_SHT0_256 (DAC12_CTL0_SHT_256)
#define DAC12_CTL0_SHT0_384 (DAC12_CTL0_SHT_384)
#define DAC12_CTL0_SHT0_512 (DAC12_CTL0_SHT_512)
#define DAC12_CTL0_SHT0_768 (DAC12_CTL0_SHT_768)
#define DAC12_CTL0_SHT0_1024 (DAC12_CTL0_SHT_1024)

#define DAC12_CTL0_R_SHT0_MASK (DAC12_CTL0_SHT0_MASK << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_4 (DAC12_CTL0_SHT0_4 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_8 (DAC12_CTL0_SHT0_8 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_16 (DAC12_CTL0_SHT0_16 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_32 (DAC12_CTL0_SHT0_32 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_64 (DAC12_CTL0_SHT0_64 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_96 (DAC12_CTL0_SHT0_96 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_128 (DAC12_CTL0_SHT0_128 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_192 (DAC12_CTL0_SHT0_192 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_256 (DAC12_CTL0_SHT0_256 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_384 (DAC12_CTL0_SHT0_384 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_512 (DAC12_CTL0_SHT0_512 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_768 (DAC12_CTL0_SHT0_768 << DAC12_CTL0_R_SHT0_BIT)
#define DAC12_CTL0_R_SHT0_1024 (DAC12_CTL0_SHT0_1024 << DAC12_CTL0_R_SHT0_BIT)
/*-----------*/

/*-----------*/
#define DAC12_CTL0_R_SHT1_BIT ((uint16_t) 12U)

#define DAC12_CTL0_SHT1_MASK (DAC12_CTL0_SHT_MASK)
#define DAC12_CTL0_SHT1_4 (DAC12_CTL0_SHT_4)
#define DAC12_CTL0_SHT1_8 (DAC12_CTL0_SHT_8)
#define DAC12_CTL0_SHT1_16 (DAC12_CTL0_SHT_16)
#define DAC12_CTL0_SHT1_32 (DAC12_CTL0_SHT_32)
#define DAC12_CTL0_SHT1_64 (DAC12_CTL0_SHT_64)
#define DAC12_CTL0_SHT1_96 (DAC12_CTL0_SHT_96)
#define DAC12_CTL0_SHT1_128 (DAC12_CTL0_SHT_128)
#define DAC12_CTL0_SHT1_192 (DAC12_CTL0_SHT_192)
#define DAC12_CTL0_SHT1_256 (DAC12_CTL0_SHT_256)
#define DAC12_CTL0_SHT1_384 (DAC12_CTL0_SHT_384)
#define DAC12_CTL0_SHT1_512 (DAC12_CTL0_SHT_512)
#define DAC12_CTL0_SHT1_768 (DAC12_CTL0_SHT_768)
#define DAC12_CTL0_SHT1_1024 (DAC12_CTL0_SHT_1024)

#define DAC12_CTL0_R_SHT1_MASK (DAC12_CTL0_SHT1_MASK << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_4 (DAC12_CTL0_SHT1_4 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_8 (DAC12_CTL0_SHT1_8 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_16 (DAC12_CTL0_SHT1_16 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_32 (DAC12_CTL0_SHT1_32 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_64 (DAC12_CTL0_SHT1_64 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_96 (DAC12_CTL0_SHT1_96 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_128 (DAC12_CTL0_SHT1_128 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_192 (DAC12_CTL0_SHT1_192 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_256 (DAC12_CTL0_SHT1_256 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_384 (DAC12_CTL0_SHT1_384 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_512 (DAC12_CTL0_SHT1_512 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_768 (DAC12_CTL0_SHT1_768 << DAC12_CTL0_R_SHT1_BIT)
#define DAC12_CTL0_R_SHT1_1024 (DAC12_CTL0_SHT1_1024 << DAC12_CTL0_R_SHT1_BIT)
/*-----------*/

#endif /* DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_CTL0_H_ */
